NXP-MCU-X-Lab/nxp_easy_mcuboot/Project/frdm_mcxc162/mcxc162_example_app/drivers/fsl_spc.c
    if ((base->SC & SPC_SC_BUSY_MASK) != 0UL)
    {
        return kStatus_SPC_Busy;
    }

    base->ACTIVE_CFG =
        ((base->ACTIVE_CFG) & ~(SPC_ACTIVE_CFG_BGMODE_MASK)) | SPC_ACTIVE_CFG_BGMODE(config->bandgapMode);
#if (defined(FSL_FEATURE_MCX_SPC_HAS_LPBUFF_EN_BIT) && FSL_FEATURE_MCX_SPC_HAS_LPBUFF_EN_BIT)
    SPC_EnableActiveModeCMPBandgapBuffer(base, config->lpBuff);
#endif /* FSL_FEATURE_MCX_SPC_HAS_LPBUFF_EN_BIT */

#if (defined(FSL_FEATURE_MCX_SPC_HAS_SYS_LDO) && FSL_FEATURE_MCX_SPC_HAS_SYS_LDO)
    (void)SPC_SetActiveModeSystemLDORegulatorConfig(base, &config->SysLDOOption);
#endif /* FSL_FEATURE_MCX_SPC_HAS_SYS_LDO */

#if (defined(FSL_FEATURE_MCX_SPC_HAS_DCDC) && FSL_FEATURE_MCX_SPC_HAS_DCDC)
    (void)SPC_SetActiveModeDCDCRegulatorConfig(base, &config->DCDCOption);
#endif /* FSL_FEATURE_MCX_SPC_HAS_DCDC */

    (void)SPC_SetActiveModeCoreLDORegulatorConfig(base, &config->CoreLDOOption);

    return kStatus_Success;
}

/*!
 * brief Configs regulators in Low Power mode.
 *
 * This function provides the method to config all on-chip regulators in Low Power mode.
 *
 * param base SPC peripheral base address.
 * param config Pointer to spc_lowpower_mode_regulators_config_t structure.
 * retval #kStatus_Success Config regulators in Low power mode successful.
 * retval #kStatus_SPC_BandgapModeWrong The bandgap should not be disabled based on input settings.
 * retval #kStatus_SPC_CORELDOLowDriveStrengthIgnore Set driver strength to low will be ignored.
 * retval #kStatus_SPC_SYSLDOLowDriveStrengthIgnore Set driver strength to low will be ignored.
 * retval #kStatus_SPC_CORELDOVoltageWrong Core LDO and System LDO do not have same voltage level.
 */
status_t SPC_SetLowPowerModeRegulatorsConfig(SPC_Type *base, const spc_lowpower_mode_regulators_config_t *config)
{
    assert(config != NULL);
    uint32_t lpModeVDValue = SPC_GetLowPowerModeVoltageDetectStatus(base);

    /* Check input parameters */
    /*  1. Bandgap should not be disabled if any of regulator in normal drive strength or
            if any of LVDs/HVDs are enabled or if VDD CORE glitch detect are enabled. */
    if ((config->bandgapMode == kSPC_BandgapDisabled) &&
        ((lpModeVDValue != 0UL)
#if !(defined(FSL_FEATURE_MCX_SPC_HAS_NO_GLITCH_DETECT) && FSL_FEATURE_MCX_SPC_HAS_NO_GLITCH_DETECT)
         || (SPC_CheckLowPowerModeVddCoreGlitchDetectEnabled(base) == true)
#endif /* FSL_FEATURE_MCX_SPC_HAS_NO_GLITCH_DETECT */
#if (defined(FSL_FEATURE_MCX_SPC_HAS_DCDC) && FSL_FEATURE_MCX_SPC_HAS_DCDC)
         || (config->DCDCOption.DCDCDriveStrength == kSPC_DCDC_NormalDriveStrength)
#endif /* FSL_FEATURE_MCX_SPC_HAS_DCDC */
#if (defined(FSL_FEATURE_MCX_SPC_HAS_SYS_LDO) && FSL_FEATURE_MCX_SPC_HAS_SYS_LDO)
         || (config->SysLDOOption.SysLDODriveStrength == kSPC_SysLDO_NormalDriveStrength)
#endif /* FSL_FEATURE_MCX_SPC_HAS_SYS_LDO */
#if (defined(FSL_FEATURE_SPC_HAS_CORELDO_VDD_DS) && FSL_FEATURE_SPC_HAS_CORELDO_VDD_DS)
         || (config->CoreLDOOption.CoreLDODriveStrength == kSPC_CoreLDO_NormalDriveStrength)
#endif /* FSL_FEATURE_SPC_HAS_CORELDO_VDD_DS */
             ))
    {
        return kStatus_SPC_BandgapModeWrong;
    }

#if (defined(FSL_FEATURE_MCX_SPC_HAS_SYS_LDO) && FSL_FEATURE_MCX_SPC_HAS_SYS_LDO)
    /* 2. To set System LDO's drive strength to low, all LVDs and HVDs must be disabled. */
    if ((lpModeVDValue != 0UL) && (config->SysLDOOption.SysLDODriveStrength == kSPC_SysLDO_LowDriveStrength))
    {
        return kStatus_SPC_SYSLDOLowDriveStrengthIgnore;
    }
#endif /* FSL_FEATURE_MCX_SPC_HAS_SYS_LDO */

#if (defined(FSL_FEATURE_SPC_HAS_CORELDO_VDD_DS) && FSL_FEATURE_SPC_HAS_CORELDO_VDD_DS)
    /* 3. To set Core LDO's drive strength to low, all LVDs and HVDs must be disabled. */
    if ((lpModeVDValue != 0UL) && (config->CoreLDOOption.CoreLDODriveStrength == kSPC_CoreLDO_LowDriveStrength))
    {
        return kStatus_SPC_CORELDOLowDriveStrengthIgnore;
    }
#endif /* FSL_FEATURE_SPC_HAS_CORELDO_VDD_DS */

#if (defined(FSL_FEATURE_MCX_SPC_HAS_DCDC) && FSL_FEATURE_MCX_SPC_HAS_DCDC)
    /* 5. Core LDO and DCDC should have same voltage level. */
    if ((uint8_t)config->DCDCOption.DCDCVoltage != (uint8_t)config->CoreLDOOption.CoreLDOVoltage)
    {
        /* In case of DCDC voltage level to retention voltage, must disable VDD_CORE LDO, and
        CORELDO voltage level can be different with DCDC voltage level. */

        if (config->DCDCOption.DCDCVoltage == kSPC_DCDC_RetentionVoltage)
        {
            if ((SPC_GetLowPowerModeVoltageDetectStatus(base) & SPC_LP_CFG_CORE_LVDE_MASK) != 0UL)
            {
                return kStatus_SPC_CORELDOVoltageDetectWrong;
            }
        }
        else
        {
            return kStatus_SPC_DCDCCoreLdoVoltageMisMatch;
        }
    }
#endif /* FSL_FEATURE_MCX_SPC_HAS_DCDC */
    base->LP_CFG = ((base->LP_CFG) & ~(SPC_LP_CFG_BGMODE_MASK)) | SPC_LP_CFG_BGMODE(config->bandgapMode);
#if (defined(FSL_FEATURE_MCX_SPC_HAS_LPBUFF_EN_BIT) && FSL_FEATURE_MCX_SPC_HAS_LPBUFF_EN_BIT)
    SPC_EnableLowPowerModeCMPBandgapBuffer(base, config->lpBuff);
#endif /* FSL_FEATURE_MCX_SPC_HAS_LPBUFF_EN_BIT */
#if (defined(FSL_FEATURE_MCX_SPC_HAS_COREVDD_IVS_EN_BIT) && FSL_FEATURE_MCX_SPC_HAS_COREVDD_IVS_EN_BIT)
    SPC_EnableLowPowerModeCoreVDDInternalVoltageScaling(base, config->CoreIVS);
#endif /* FSL_FEATURE_MCX_SPC_HAS_COREVDD_IVS_EN_BIT */
    SPC_EnableLowPowerModeLowPowerIREF(base, config->lpIREF);

#if (defined(FSL_FEATURE_MCX_SPC_HAS_SYS_LDO) && FSL_FEATURE_MCX_SPC_HAS_SYS_LDO)
    (void)SPC_SetLowPowerModeSystemLDORegulatorConfig(base, &config->SysLDOOption);
#endif /* FSL_FEATURE_MCX_SPC_HAS_SYS_LDO */

#if (defined(FSL_FEATURE_MCX_SPC_HAS_DCDC) && FSL_FEATURE_MCX_SPC_HAS_DCDC)
    (void)SPC_SetLowPowerModeDCDCRegulatorConfig(base, &config->DCDCOption);
#endif /* FSL_FEATURE_MCX_SPC_HAS_DCDC */

    (void)SPC_SetLowPowerModeCoreLDORegulatorConfig(base, &config->CoreLDOOption);

    return kStatus_Success;
}
